/*

 - Не змінює оригінальний масив.
 - Поелементо перебирає оригінальний масив.
 - Повертає новий масив.
 - Додає у масив, що повертається, елементи, які задовольняють умови колбек-функції.
 - Якщо колбек повернув true, елемент додається у масив, що повертається.
 - Якщо колбек повернув false, елемент не додається у масив, що повертається.
 - Якщо жоден елемент не задовольнив умову, повертає порожній масив.

*/

// let array = [1, 3, 56, 1, 5, 78, 2, 6];

// let result = array.filter((element) => {
//   return element < 50;
// });

// console.log(array);
