/*

    EVERY
 - Не змінює оригінальний масив.
 - Поелементо перебирає оригінальний масив.
 - Повертає true, якщо всі елементи масиву задовольняють умову.
 - Повертає false, якщо хоча б один елемент масиву не задовольняє умову.
 - Перебирання масиву припиняється, якщо колбек повертає false.

*/

// let array = [0, 0, 0];
// // console.log(array.every((element) => element / 2 >= 10));

/*

    SOME
 - Не змінює оригінальний масив.
 - Поелементо перебирає оригінальний масив.
 - Повертає true, якщо хоча б один елемент масиву задовольняє умову.
 - Повертає false, якщо жоден елемент масиву не задовольняє умову.
 - Перебирання масиву припиняється, якщо колбек повертає true.

*/
// console.log(array.some((element) => element));
