let todos = [];

fetch("https://jsonplaceholder.typicode.com/posts")
  .then((response) => response.json())
  .then((json) => (todos = json));

setTimeout(() => {
  console.log(todos);
}, 1000);

/* 
  1. Відображати всі елементи
  2. Комбінація клавіш відкриває модальне вікно пошуку
  3. опрацювати події для закриття модального вікна
  4. фільтрувати елементи за критерієм пошуку
  5. при наведенні на кнопку закриття модального вікна підсвічувати її (class 'tomato')

  6. Свторити модальне вікно для створення TODOS
  
*/
